[
  {
    "dialogue_id": "sample_001",
    "turns": [
      {"user": "Hi, I'm looking for a restaurant in the centre of town.", "agent": "There are many restaurants in the centre. What type of cuisine would you prefer?"},
      {"user": "I'd like something Italian please.", "agent": "I found several Italian restaurants in the centre. Prezzo and Pizza Hut City Centre are both highly rated."},
      {"user": "Can you book Prezzo for 4 people at 7pm tomorrow?", "agent": "I've booked Prezzo for 4 people tomorrow at 7pm. Your reference number is REF123."}
    ],
    "domains": ["restaurant"]
  },
  {
    "dialogue_id": "sample_002",
    "turns": [
      {"user": "I need a taxi to take me from the hotel to the restaurant.", "agent": "I can help with that. What time would you like to be picked up?"},
      {"user": "Around 6:30pm please.", "agent": "I've booked a taxi for 6:30pm. The car is a blue Honda and the contact number is 07845234567."}
    ],
    "domains": ["taxi"]
  },
  {
    "dialogue_id": "sample_003",
    "turns": [
      {"user": "Hello, I'm looking for a hotel in Cambridge.", "agent": "There are many hotels available. Do you have a preference for star rating or price range?"},
      {"user": "I'd like something cheap with free parking.", "agent": "I found the Alexander Bed and Breakfast. It's a cheap guesthouse with free parking."},
      {"user": "That sounds good. Can you book it for 2 nights starting Friday?", "agent": "I've made a reservation at Alexander Bed and Breakfast for 2 nights starting Friday. Your reference is HOTEL456."},
      {"user": "Great, thanks! Also, is there breakfast included?", "agent": "Yes, breakfast is included with your stay at the Alexander Bed and Breakfast."}
    ],
    "domains": ["hotel"]
  },
  {
    "dialogue_id": "sample_004",
    "turns": [
      {"user": "I want to visit some attractions in Cambridge.", "agent": "Cambridge has many attractions. What type are you interested in - museums, churches, parks?"},
      {"user": "I'd like to see some museums.", "agent": "The Fitzwilliam Museum is highly recommended. It's free to enter and has an excellent art collection."},
      {"user": "What are the opening hours?", "agent": "The Fitzwilliam Museum is open Tuesday to Saturday from 10am to 5pm, and Sunday from 12pm to 5pm."}
    ],
    "domains": ["attraction"]
  },
  {
    "dialogue_id": "sample_005",
    "turns": [
      {"user": "I need a train from Cambridge to London.", "agent": "There are many trains to London. What day and time would you prefer to travel?"},
      {"user": "Saturday morning, around 9am.", "agent": "There's a train at 9:05am arriving at London Kings Cross at 10:07am. The fare is £23.50."},
      {"user": "Can you book that for 2 people?", "agent": "I've booked 2 tickets on the 9:05am train to London. Your reference is TRAIN789."}
    ],
    "domains": ["train"]
  },
  {
    "dialogue_id": "sample_006",
    "turns": [
      {"user": "Hi, I need help with multiple things today.", "agent": "Of course! What can I help you with?"},
      {"user": "First, find me a moderately priced restaurant.", "agent": "I found several moderately priced restaurants. What cuisine would you prefer?"},
      {"user": "Chinese food please.", "agent": "The Golden Wok is a great moderately priced Chinese restaurant. Shall I make a reservation?"},
      {"user": "Yes, for 3 people at 8pm tonight.", "agent": "I've booked Golden Wok for 3 people at 8pm tonight. Reference: GW321."},
      {"user": "Now I need a taxi to get there.", "agent": "Where would you like to be picked up from?"},
      {"user": "From the train station.", "agent": "I've arranged a taxi from the train station to Golden Wok for 7:30pm. The driver will contact you."}
    ],
    "domains": ["restaurant", "taxi"]
  },
  {
    "dialogue_id": "sample_007",
    "turns": [
      {"user": "Can you recommend a good hotel near the city centre?", "agent": "The Hilton Cambridge City Centre is excellent and very central."},
      {"user": "Is it expensive?", "agent": "Yes, the Hilton is in the expensive price range, around £150 per night."},
      {"user": "Do you have something cheaper?", "agent": "The Ibis Cambridge Central Station is moderately priced at around £80 per night."},
      {"user": "Book the Ibis for me please, 3 nights starting Monday.", "agent": "I've booked the Ibis Cambridge for 3 nights from Monday. Reference: IBIS555."}
    ],
    "domains": ["hotel"]
  },
  {
    "dialogue_id": "sample_008",
    "turns": [
      {"user": "What entertainment options are there in town?", "agent": "There are several options including cinemas, bowling, and live music venues."},
      {"user": "I'd prefer something cultural.", "agent": "The ADC Theatre has excellent performances. There's also the Corn Exchange for concerts."},
      {"user": "What's showing at the ADC Theatre this week?", "agent": "This week they have a production of Hamlet running Wednesday through Saturday."}
    ],
    "domains": ["attraction"]
  },
  {
    "dialogue_id": "sample_009",
    "turns": [
      {"user": "I need to travel to Birmingham tomorrow.", "agent": "I can help with trains or other transport to Birmingham. What time would you like to depart?"},
      {"user": "Early morning, before 8am if possible.", "agent": "There's a train at 7:22am arriving in Birmingham New Street at 9:45am. Price is £35."},
      {"user": "That works. One ticket please.", "agent": "I've booked 1 ticket for the 7:22am train to Birmingham. Your reference is BHAM901."},
      {"user": "Perfect. Now I also need somewhere to stay in Birmingham.", "agent": "I'm sorry, I can only help with accommodations in Cambridge. For Birmingham hotels, you might try a different service."}
    ],
    "domains": ["train", "hotel"]
  },
  {
    "dialogue_id": "sample_010",
    "turns": [
      {"user": "Hello! I want to plan a day out.", "agent": "I'd be happy to help you plan your day. What would you like to do?"},
      {"user": "Start with breakfast, then some sightseeing.", "agent": "For breakfast, Aromi is excellent for Italian pastries. For sightseeing, I recommend King's College Chapel."},
      {"user": "Book a table at Aromi for 9am.", "agent": "I've reserved a table at Aromi for 9am tomorrow. Reference: AROMI101."},
      {"user": "And what time does King's College Chapel open?", "agent": "King's College Chapel opens at 9:30am on weekdays. Entry is £9 for adults."},
      {"user": "Great, and I'll need a taxi from Aromi to the chapel.", "agent": "I've arranged a taxi from Aromi to King's College Chapel for 10:30am. Car is a silver Toyota."}
    ],
    "domains": ["restaurant", "attraction", "taxi"]
  }
]
